W10D5/TodoApp/app/controllers/api/todos_controller.rb

    def create
        @todo = Todo.new(todo_params)
        if @todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "eat Good Food"], ["body", "Unagi"], ["done", false], ["created_at", "2020-10-02 22:05:31.725501"], ["updated_at", "2020-10-02 22:05:31.725501"]]

    def update
        @todo = Todo.find(params[:id])
        if @todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", true], ["updated_at", "2020-10-02 22:07:23.140072"], ["id", 6]]

    def destroy
        @todo = Todo.find(params[:id])
        @todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 6]]