W7D3/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "pizza11@pizzalovers.com"], ["created_at", "2020-09-09 19:12:33.625838"], ["updated_at", "2020-09-09 19:12:33.625838"]]
---
    def create
        @user = User.new(user_params)
        if @user.save